# 1. Базовый образ с Python
FROM python:3.9-slim

# 2. Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# 3. Копируем файл с зависимостями и устанавливаем их
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# 4. Копируем все файлы проекта в рабочую директорию
COPY . .

# 5. Указываем порт, который будет слушать наше приложение
EXPOSE 5000

# 6. Команда, которая будет запущена при старте контейнера
CMD ["gunicorn", "--bind", "0.0.0.0:5000", "app.main:app"]